In [16]:
### Copy and paste top of lab 4 to extract data warehouse and its tables from SQL

import os
import json
import numpy
import datetime
import certifi
import pandas as pd

import pymongo
import sqlalchemy
from sqlalchemy import create_engine, text

print(f"Running SQL Alchemy Version: {sqlalchemy.__version__}")
print(f"Running PyMongo Version: {pymongo.__version__}")

mysql_args = {
    "uid" : "root",
    "pwd" : "Qzk11$soccer15",
    "hostname" : "localhost",
    "dbname" : "adventureworks_dw"
}

def get_sql_dataframe(sql_query, **args):
    '''Connect to MySQL, run a SQL query, and return a DataFrame.'''
    conn_str = f"mysql+pymysql://{args['uid']}:{args['pwd']}@{args['hostname']}/{args['dbname']}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    dframe = pd.read_sql(text(sql_query), connection)
    connection.close()
    
    return dframe

### Print tables to ensure all 4 were properly extracted from SQL  

df_test = get_sql_dataframe("SHOW TABLES;", **mysql_args)
print(df_test)

Running SQL Alchemy Version: 2.0.39
Running PyMongo Version: 4.15.3
  Tables_in_adventureworks_dw
0                dim_customer
1                    dim_date
2                 dim_product
3                  fact_sales

In [17]:
### Run each of the tables, but display only the first few data using head() to avoid data overload 
### Title each table correspondingly 

df_customer = get_sql_dataframe("SELECT * FROM dim_customer LIMIT 10;", **mysql_args)
df_date = get_sql_dataframe("SELECT * FROM dim_date LIMIT 10;", **mysql_args)
df_product = get_sql_dataframe("SELECT * FROM dim_product LIMIT 10;", **mysql_args)
df_sales = get_sql_dataframe("SELECT * FROM fact_sales LIMIT 10;", **mysql_args)

print("Customer Table")
display(df_customer.head())

print("Date Table")
display(df_date.head())

print("Product Table")
display(df_product.head())

print("Sales Table")
display(df_sales.head())

Customer Table

   customer_key  territory_id account_number customer_type
0             1             1     AW00000001             S
1             2             1     AW00000002             S
2             3             4     AW00000003             S
3             4             4     AW00000004             S
4             5             4     AW00000005             S

Date Table

   date_key   full_date  year  month  day
0  20010701  2001-07-01  2001      7    1
1  20010702  2001-07-02  2001      7    2
2  20010703  2001-07-03  2001      7    3
3  20010704  2001-07-04  2001      7    4
4  20010705  2001-07-05  2001      7    5

Product Table

   product_key           product_name product_number  list_price
0            1        Adjustable Race        AR-5381         0.0
1            2           Bearing Ball        BA-8327         0.0
2            3        BB Ball Bearing        BE-2349         0.0
3            4  Headset Ball Bearings        BE-2908         0.0
4          316                  Blade        BL-2036         0.0

Sales Table

,sales_order_id,product_key,customer_key,date_key,quantity,unit_price,sales_amount
0,43659,776,676,20010701,1,2024.99,2024.99
1,43659,777,676,20010701,3,2024.99,6074.98
2,43659,778,676,20010701,1,2024.99,2024.99
3,43659,771,676,20010701,1,2039.99,2039.99
4,43659,772,676,20010701,1,2039.99,2039.99

In [21]:
from pymongo import MongoClient
import pandas as pd

# Connect to MongoDB and export one table 

mongo_uri = "mongodb+srv://kendallstimart:Roxy2015@cluster1.sso2uqs.mongodb.net/?appName=Cluster1"
client = MongoClient(mongo_uri)

db = client["adventureworks_mongo"]
coll = db["dim_customer"]

if coll.count_documents({}) == 0:
    coll.insert_many(df_customer.to_dict("records"))

sample_docs = list(coll.find().limit(5))
pd.DataFrame(sample_docs)

,_id,customer_key,territory_id,account_number,customer_type
0,691bca88b7435d9cfc53a64a,1,1,AW00000001,S
1,691bca88b7435d9cfc53a64b,2,1,AW00000002,S
2,691bca88b7435d9cfc53a64c,3,4,AW00000003,S
3,691bca88b7435d9cfc53a64d,4,4,AW00000004,S
4,691bca88b7435d9cfc53a64e,5,4,AW00000005,S

In [18]:

import os
import numpy as np
import pandas as pd
import pymongo
import sqlalchemy
from sqlalchemy import create_engine, text

mysql_args = {
    "uid": "root",
    "pwd": "Qzk11$soccer15",
    "hostname": "localhost",
    "dbname": "adventureworks_dw"
}
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:Qzk11$soccer15@localhost/adventureworks_dw")

def get_sql_dataframe(sql_query, **args):
    '''Connect to MySQL, run a SQL query, and return a DataFrame.'''
    conn_str = f"mysql+pymysql://{args['uid']}:{args['pwd']}@{args['hostname']}/{args['dbname']}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()

    dframe = pd.read_sql(text(sql_query), connection)
    connection.close()
    return dframe
    
df_customer = get_sql_dataframe("SELECT * FROM dim_customer;", **mysql_args)
df_date = get_sql_dataframe("SELECT * FROM dim_date;", **mysql_args)
df_product = get_sql_dataframe("SELECT * FROM dim_product;", **mysql_args)
df_sales = get_sql_dataframe("SELECT * FROM fact_sales;", **mysql_args)

In [19]:
### Add in new csv file from excel (created own table)
df_salesperson = pd.read_csv("dim_salesperson.csv")
display(df_salesperson)

   salesperson_id first_name  last_name
0               1   Jennifer   Connally
1               2    Gerard        Cary
2               3     Lawrie   Freedman
3               4       Mary  Alexander
4               5        Jim      Davis